https://Axot017.app.spacelift.io/stack/terraform-spacelift-example/run/01JZQBZ8N2NPEPRZ33GPJTGHN1 has finished

## Initializing

```
[01JZPZPGJN6XRJ1WD45WFSC8YW] Using binary "tofu" from /bin/tofu
[01JZPZPGJN6XRJ1WD45WFSC8YW] Merging .terraformrc files...
[01JZPZPGJN6XRJ1WD45WFSC8YW] .terraformrc files merged successfully
[01JZPZPGJN6XRJ1WD45WFSC8YW] Initializing workspace with 0 custom hooks...

Initializing the backend...
Initializing modules...
- example-stack in ../..

Initializing provider plugins...
- Finding latest version of spacelift-io/spacelift...
- Installing spacelift-io/spacelift v1.25.0...
- Installed spacelift-io/spacelift v1.25.0 (signed, key ID E302FB5AA29D88F7)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

╷
│ Warning: Redundant empty provider block
│ 
│   on ../../variables.tf line 1:
│    1: provider "spacelift" {}
│ 
│ Earlier versions of OpenTofu used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "spacelift" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.example-stack:
│     spacelift = {
│       source = "spacelift-io/spacelift"
│     }
│ 
│ (and one more similar warning elsewhere)
╵

OpenTofu has been successfully initialized!
[01JZPZPGJN6XRJ1WD45WFSC8YW] Workspace is GO
```

## Preparing

```
[Ground Control] This is Ground Control to private worker 01JZPZPGJN6XRJ1WD45WFSC8YW, commencing countdown
[Ground Control] No initialization policies attached
[Ground Control] Creating metadata...
[Ground Control] Uploading metadata...
[Ground Control] Metadata is GO
[Ground Control] Creating workspace...
[Ground Control] Encrypting workspace...
[Ground Control] Uploading workspace...
[Ground Control] Workspace is GO
[Ground Control] We're ready 01JZPZPGJN6XRJ1WD45WFSC8YW
[Ground Control] Over to you 01JZPZPGJN6XRJ1WD45WFSC8YW, we'll see you on the other side
[01JZPZPGJN6XRJ1WD45WFSC8YW] Mic check 1 2, is this thing on?
[01JZPZPGJN6XRJ1WD45WFSC8YW] This is 01JZPZPGJN6XRJ1WD45WFSC8YW to Ground Control, I'm on
[01JZPZPGJN6XRJ1WD45WFSC8YW] Downloading and decrypting workspace...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Unpacking the workspace...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Workspace is GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Reading static run environment file...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Static run environment is GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Downloading metadata...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Metadata is GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Downloading source code...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Source code is GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Setting up mounted files...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Mounted files are GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Configuring file permissions...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Permissions are GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Evaluating run initialization policy...
[01JZPZPGJN6XRJ1WD45WFSC8YW] No initialization policies attached
[01JZPZPGJN6XRJ1WD45WFSC8YW] Docker image is cached
[01JZPZPGJN6XRJ1WD45WFSC8YW] Pulling Docker image public.ecr.aws/spacelift/runner-terraform:latest...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Pulling from spacelift/runner-terraform
[01JZPZPGJN6XRJ1WD45WFSC8YW] Digest: sha256:f7705d9c6e98b70bd26e7f0a6b143d39af0bb33f4c6470a27a632aaa33d6fa2e
[01JZPZPGJN6XRJ1WD45WFSC8YW] Status: Image is up to date for public.ecr.aws/spacelift/runner-terraform:latest
[01JZPZPGJN6XRJ1WD45WFSC8YW] Docker image is GO (digest: f7705d9c6e98)
[01JZPZPGJN6XRJ1WD45WFSC8YW] Downloading OpenTofu 1.10.2...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Using OpenTofu 1.10.2 from cache
[01JZPZPGJN6XRJ1WD45WFSC8YW] OpenTofu 1.10.2 download is GO (/bin/tofu)
[01JZPZPGJN6XRJ1WD45WFSC8YW] Creating Docker container...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Starting Docker container...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Docker container is GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Verifying container image prerequisites...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Successfully verified container image prerequisites
[01JZPZPGJN6XRJ1WD45WFSC8YW] Using OpenTofu workflow...
```

## Preparing apply

```

```

## Preparing replan

```

```

## Planning logs

```
[01JZPZPGJN6XRJ1WD45WFSC8YW] Planning changes with 0 custom hooks...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.example-stack.spacelift_stack.example-stack will be created
  + resource "spacelift_stack" "example-stack" {
      + administrative                   = true
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Shared production infrastructure (networking, k8s) - 2"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "example-stack"
      + protect_from_deletion            = false
      + repository                       = "onboarding"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_version                = "1.5.0"
      + terraform_workflow_tool          = (known after apply)
    }

  # module.example-stack.spacelift_webhook.simple-webhook-4 will be created
  + resource "spacelift_webhook" "simple-webhook-4" {
      + enabled  = true
      + endpoint = "https://example.com/example_webhook"
      + id       = (known after apply)
      + secret   = (sensitive value)
      + stack_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Redundant empty provider block
│ 
│   on ../../variables.tf line 1:
│    1: provider "spacelift" {}
│ 
│ Earlier versions of OpenTofu used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "spacelift" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.example-stack:
│     spacelift = {
│       source = "spacelift-io/spacelift"
│     }
╵
[01JZPZPGJN6XRJ1WD45WFSC8YW] Changes are GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Uploading the list of managed resources...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Please be aware that the run changes calculation includes output changes.
[01JZPZPGJN6XRJ1WD45WFSC8YW] Resource list upload is GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Generating JSON representation of the plan...
[01JZPZPGJN6XRJ1WD45WFSC8YW] JSON representation is GO
[01JZPZPGJN6XRJ1WD45WFSC8YW] Loading custom plan policy inputs...
[01JZPZPGJN6XRJ1WD45WFSC8YW] 0 custom plan policy inputs found
[01JZPZPGJN6XRJ1WD45WFSC8YW] No plan policies to evaluate
```

## Applying

```
[01JZPZPGJN6XRJ1WD45WFSC8YW] Running 0 custom hooks...
[01JZPZPGJN6XRJ1WD45WFSC8YW] Applying changes...
module.example-stack.spacelift_stack.example-stack: Creating...
module.example-stack.spacelift_stack.example-stack: Creation complete after 1s [id=example-stack]
module.example-stack.spacelift_webhook.simple-webhook-4: Creating...
module.example-stack.spacelift_webhook.simple-webhook-4: Creation complete after 1s [id=01JZQBZYTS5BA4KTRFRQW0GW48]
╷
│ Warning: Redundant empty provider block
│ 
│   on ../../variables.tf line 1:
│    1: provider "spacelift" {}
│ 
│ Earlier versions of OpenTofu used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "spacelift" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.example-stack:
│     spacelift = {
│       source = "spacelift-io/spacelift"
│     }
╵

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

[01JZPZPGJN6XRJ1WD45WFSC8YW] Changes applied successfully
```

## Performing

```

```

## Destroying

```
[01JZPZPGJN6XRJ1WD45WFSC8YW] Destroying created resources with 0 custom hooks...
module.example-stack.spacelift_stack.example-stack: Refreshing state... [id=example-stack]
module.example-stack.spacelift_webhook.simple-webhook-4: Refreshing state... [id=01JZQBZYTS5BA4KTRFRQW0GW48]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

OpenTofu will perform the following actions:

  # module.example-stack.spacelift_stack.example-stack will be destroyed
  - resource "spacelift_stack" "example-stack" {
      - additional_project_globs         = [] -> null
      - administrative                   = true -> null
      - after_apply                      = [] -> null
      - after_destroy                    = [] -> null
      - after_init                       = [] -> null
      - after_perform                    = [] -> null
      - after_plan                       = [] -> null
      - after_run                        = [] -> null
      - autodeploy                       = false -> null
      - autoretry                        = false -> null
      - aws_assume_role_policy_statement = jsonencode(
            {
              - Action    = "sts:AssumeRole"
              - Condition = {
                  - StringEquals = {
                      - "sts:ExternalId" = "Axot017@example-stack"
                    }
                }
              - Effect    = "Allow"
              - Principal = {
                  - AWS = "913524909588"
                }
            }
        ) -> null
      - before_apply                     = [] -> null
      - before_destroy                   = [] -> null
      - before_init                      = [] -> null
      - before_perform                   = [] -> null
      - before_plan                      = [] -> null
      - branch                           = "main" -> null
      - description                      = "Shared production infrastructure (networking, k8s) - 2" -> null
      - enable_local_preview             = false -> null
      - enable_sensitive_outputs_upload  = true -> null
      - enable_well_known_secret_masking = false -> null
      - github_action_deploy             = true -> null
      - id                               = "example-stack" -> null
      - labels                           = [] -> null
      - manage_state                     = true -> null
      - name                             = "example-stack" -> null
      - protect_from_deletion            = false -> null
      - repository                       = "onboarding" -> null
      - slug                             = "example-stack" -> null
      - space_id                         = "root" -> null
      - terraform_external_state_access  = false -> null
      - terraform_smart_sanitization     = false -> null
      - terraform_version                = "1.5.0" -> null
      - terraform_workflow_tool          = "TERRAFORM_FOSS" -> null
    }

  # module.example-stack.spacelift_webhook.simple-webhook-4 will be destroyed
  - resource "spacelift_webhook" "simple-webhook-4" {
      - enabled  = true -> null
      - endpoint = "https://example.com/example_webhook" -> null
      - id       = "01JZQBZYTS5BA4KTRFRQW0GW48" -> null
      - stack_id = "example-stack" -> null
    }

Plan: 0 to add, 0 to change, 2 to destroy.
module.example-stack.spacelift_webhook.simple-webhook-4: Destroying... [id=01JZQBZYTS5BA4KTRFRQW0GW48]
module.example-stack.spacelift_webhook.simple-webhook-4: Destruction complete after 0s
module.example-stack.spacelift_stack.example-stack: Destroying... [id=example-stack]
module.example-stack.spacelift_stack.example-stack: Destruction complete after 0s
╷
│ Warning: Redundant empty provider block
│ 
│   on ../../variables.tf line 1:
│    1: provider "spacelift" {}
│ 
│ Earlier versions of OpenTofu used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "spacelift" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.example-stack:
│     spacelift = {
│       source = "spacelift-io/spacelift"
│     }
╵

Destroy complete! Resources: 2 destroyed.

[01JZPZPGJN6XRJ1WD45WFSC8YW] Successfully destroyed created resources
```

